//===================================================================
// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
//===================================================================


Console.Write("Write a = ");
string? a = Console.ReadLine();

if (a != null )
{
    int a_int = int.Parse(a);
   
    if (a_int % 2 == 0)
    {
        Console.Write("a - четное");
    }
    else
    {
        Console.Write("a - нечетное");
    }
    
}


