//===================================================================
// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
//===================================================================


Console.Write("Write N = ");
string? n = Console.ReadLine();

if (n != null )
{
    int n_int = int.Parse(n);
    int i = 2;
    while (i <= n_int)
    {
        if (i%2 == 0)
        {
            Console.WriteLine(i);
        }
        i++;
    }
}


